HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxEdsadc_reg.h
/** \brief 6A8, Rectification Configuration Register 5 */
#define EDSADC_CH5_RECTCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RECTCFG*)0xF00246A8u)
/** Alias (User Manual Name) for EDSADC_CH5_RECTCFG.
* To use register names with standard convension, please use EDSADC_CH5_RECTCFG.
*/
#define EDSADC_RECTCFG5 (EDSADC_CH5_RECTCFG)

/** \brief 6B0, Common Mode Voltage Register 5 */
#define EDSADC_CH5_VCM /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_VCM*)0xF00246B0u)
/** Alias (User Manual Name) for EDSADC_CH5_VCM.
* To use register names with standard convension, please use EDSADC_CH5_VCM.
*/
#define EDSADC_VCM5 (EDSADC_CH5_VCM)

/** \brief 700, Modulator Configuration Register 6 */
#define EDSADC_CH6_MODCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_MODCFG*)0xF0024700u)
/** Alias (User Manual Name) for EDSADC_CH6_MODCFG.
* To use register names with standard convension, please use EDSADC_CH6_MODCFG.
*/
#define EDSADC_MODCFG6 (EDSADC_CH6_MODCFG)

/** \brief 708, Demodulator Input Config. Register 6 */
#define EDSADC_CH6_DICFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_DICFG*)0xF0024708u)
/** Alias (User Manual Name) for EDSADC_CH6_DICFG.
* To use register names with standard convension, please use EDSADC_CH6_DICFG.
*/
#define EDSADC_DICFG6 (EDSADC_CH6_DICFG)

/** \brief 710, Filter Configuration Register 6, Main */
#define EDSADC_CH6_FCFGM /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCFGM*)0xF0024710u)
/** Alias (User Manual Name) for EDSADC_CH6_FCFGM.
* To use register names with standard convension, please use EDSADC_CH6_FCFGM.
*/
#define EDSADC_FCFGM6 (EDSADC_CH6_FCFGM)

/** \brief 714, Filter Configuration Register 6, CIC Filter */
#define EDSADC_CH6_FCFGC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCFGC*)0xF0024714u)
/** Alias (User Manual Name) for EDSADC_CH6_FCFGC.
* To use register names with standard convension, please use EDSADC_CH6_FCFGC.
*/
#define EDSADC_FCFGC6 (EDSADC_CH6_FCFGC)

/** \brief 718, Filter Counter Register 6, CIC Filter */
#define EDSADC_CH6_FCNTC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCNTC*)0xF0024718u)
/** Alias (User Manual Name) for EDSADC_CH6_FCNTC.
* To use register names with standard convension, please use EDSADC_CH6_FCNTC.
*/
#define EDSADC_FCNTC6 (EDSADC_CH6_FCNTC)

/** \brief 71C, Overshoot Compensation Cfg. Register 6 */
#define EDSADC_CH6_OVSCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_OVSCFG*)0xF002471Cu)
/** Alias (User Manual Name) for EDSADC_CH6_OVSCFG.
* To use register names with standard convension, please use EDSADC_CH6_OVSCFG.
*/
#define EDSADC_OVSCFG6 (EDSADC_CH6_OVSCFG)

/** \brief 720, Integration Window Control Register 6 */
#define EDSADC_CH6_IWCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_IWCTR*)0xF0024720u)
/** Alias (User Manual Name) for EDSADC_CH6_IWCTR.
* To use register names with standard convension, please use EDSADC_CH6_IWCTR.
*/
#define EDSADC_IWCTR6 (EDSADC_CH6_IWCTR)

/** \brief 724, Intermediate Integration Value */
#define EDSADC_CH6_IIVAL /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_IIVAL*)0xF0024724u)
/** Alias (User Manual Name) for EDSADC_CH6_IIVAL.
* To use register names with standard convension, please use EDSADC_CH6_IIVAL.
*/
#define EDSADC_IIVAL6 (EDSADC_CH6_IIVAL)

/** \brief 728, Integrator Status Register 6 */
#define EDSADC_CH6_ISTAT /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_ISTAT*)0xF0024728u)
/** Alias (User Manual Name) for EDSADC_CH6_ISTAT.
* To use register names with standard convension, please use EDSADC_CH6_ISTAT.
*/
#define EDSADC_ISTAT6 (EDSADC_CH6_ISTAT)

/** \brief 72C, Result FIFO Control Register 6 */
#define EDSADC_CH6_RFC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RFC*)0xF002472Cu)
/** Alias (User Manual Name) for EDSADC_CH6_RFC.
* To use register names with standard convension, please use EDSADC_CH6_RFC.
*/
#define EDSADC_RFC6 (EDSADC_CH6_RFC)

/** \brief 730, Result Register 6 Main */
#define EDSADC_CH6_RESM /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RESM*)0xF0024730u)
/** Alias (User Manual Name) for EDSADC_CH6_RESM.
* To use register names with standard convension, please use EDSADC_CH6_RESM.
*/
#define EDSADC_RESM6 (EDSADC_CH6_RESM)

/** \brief 738, Offset Compensation Register 6 */
#define EDSADC_CH6_OFFCOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_OFFCOMP*)0xF0024738u)
/** Alias (User Manual Name) for EDSADC_CH6_OFFCOMP.
* To use register names with standard convension, please use EDSADC_CH6_OFFCOMP.
*/
#define EDSADC_OFFCOMP6 (EDSADC_CH6_OFFCOMP)

/** \brief 73C, Gain Calibration Register 6 */
#define EDSADC_CH6_GAINCAL /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_GAINCAL*)0xF002473Cu)
/** Alias (User Manual Name) for EDSADC_CH6_GAINCAL.
* To use register names with standard convension, please use EDSADC_CH6_GAINCAL.
*/
#define EDSADC_GAINCAL6 (EDSADC_CH6_GAINCAL)

/** \brief 740, Gain Control Register 6 */
#define EDSADC_CH6_GAINCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_GAINCTR*)0xF0024740u)
/** Alias (User Manual Name) for EDSADC_CH6_GAINCTR.
* To use register names with standard convension, please use EDSADC_CH6_GAINCTR.
*/
#define EDSADC_GAINCTR6 (EDSADC_CH6_GAINCTR)

/** \brief 744, Gain Correction Register 6 */
#define EDSADC_CH6_GAINCORR /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_GAINCORR*)0xF0024744u)
/** Alias (User Manual Name) for EDSADC_CH6_GAINCORR.
* To use register names with standard convension, please use EDSADC_CH6_GAINCORR.
*/
#define EDSADC_GAINCORR6 (EDSADC_CH6_GAINCORR)

/** \brief 750, Time-Stamp Register 6 */
#define EDSADC_CH6_TSTMP /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_TSTMP*)0xF0024750u)
/** Alias (User Manual Name) for EDSADC_CH6_TSTMP.
* To use register names with standard convension, please use EDSADC_CH6_TSTMP.
*/
#define EDSADC_TSTMP6 (EDSADC_CH6_TSTMP)

/** \brief 754, Time-Stamp Counter 6 */
#define EDSADC_CH6_TSCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_TSCNT*)0xF0024754u)
/** Alias (User Manual Name) for EDSADC_CH6_TSCNT.
* To use register names with standard convension, please use EDSADC_CH6_TSCNT.
*/
#define EDSADC_TSCNT6 (EDSADC_CH6_TSCNT)

/** \brief 770, Auxiliary Filter Configuration Register 6 */
#define EDSADC_CH6_FCFGA /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCFGA*)0xF0024770u)
/** Alias (User Manual Name) for EDSADC_CH6_FCFGA.
* To use register names with standard convension, please use EDSADC_CH6_FCFGA.
*/
#define EDSADC_FCFGA6 (EDSADC_CH6_FCFGA)

/** \brief 778, Boundary Select Register 6 */
#define EDSADC_CH6_BOUNDSEL /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_BOUNDSEL*)0xF0024778u)
/** Alias (User Manual Name) for EDSADC_CH6_BOUNDSEL.
* To use register names with standard convension, please use EDSADC_CH6_BOUNDSEL.
*/
#define EDSADC_BOUNDSEL6 (EDSADC_CH6_BOUNDSEL)

/** \brief 780, Result Register 6 Auxiliary */
#define EDSADC_CH6_RESA /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RESA*)0xF0024780u)
/** Alias (User Manual Name) for EDSADC_CH6_RESA.
* To use register names with standard convension, please use EDSADC_CH6_RESA.
*/
#define EDSADC_RESA6 (EDSADC_CH6_RESA)

